Ouss789/application_drivers/stm32f4xx_drivers/drivers/Inc/stm32f407xx_gpio_diver.h
#ifndef INC_STM32F407_GPIO_DRIVER_H_
#define INC_STM32F407_GPIO_DRIVER_H_

#include<stdint.h>
#include "stm32f407xx.h"

/*  this is for handle structure */



typedef struct{

    int8_t GPIO_PinNumber;
    uint8_t GPIO_PinMode;
    uint8_t GPIO_PinPuPdControl;
    uint8_t GPIO_PinOPType;
    uint8_t PinAltFunMode;

}GPIO_PinConfig_t;



typedef struct{

    GPIO_RegDef_t *pGPIOx; /*pointer to hold the address of gpio peripheral*/
    GPIO_PinConfig_t GPIO_PinConfig;

}GPIO_Handle_t;


/* writing prototypes */

/* peripheral clock setup*/
void GPIO_PeriClockControl(GPIO_RegDef_t *pGPIOx, uint8_t EnorDi);

/* GPIO init and deinit*/
void GPIO_Init(GPIO_Handle_t *pGPIOHandle);
void GPIO_DeInit(GPIO_RegDef_t *pGPIOx);

/* Datat read and write */
uint8_t GPIO_ReadFromInputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNuber);
uint16_t GPIO_ReadFromInputPort(GPIO_RegDef_t *pGPIOx);
void GPIO_WriteToOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNuber, uint8_t Value);
void GPIO_WriteToOutputPort(GPIO_RegDef_t *pGPIOx, uint8_t PinNuber, uint16_t Value);
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNuber);

/* IRQ configuration and ISR handling*/
void GPIO_IRQConfig(uint8_t IRQNumber, uint8_t IRQPriority, uint8_t EnorDi);
void GPIO_IRQHandling(uint8_t PinNuber);








#endif /*INC_STM32F407_GPIO_DRIVER_H_*/
